---
type: VertexFormat
namespace: Autodesk.Revit.DB.DirectContext3D
version: 2024
members: 4
tags: [revit-api, class]
---

# VertexFormat

`Autodesk.Revit.DB.DirectContext3D.VertexFormat` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | VertexFormat | 2017 | `public VertexFormat ( VertexFormatBits vertexFormatBits )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsValid | 2017 | `public bool IsValid ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |